# Read all Verilog files
read_verilog verilog_dir/mk_cae.v
read_verilog verilog_dir/mk_bm4.v
read_verilog verilog_dir/mk_bm8.v
read_verilog verilog_dir/mk_mdsa_bitonic.v

# Set top module and check hierarchy
hierarchy -check -top mk_mdsa_bitonic

# Start synthesis
proc
opt
memory
opt
techmap
opt

# Map to gates and optimize
abc -g gates

# Show statistics
stat
